sqfmi/arduino-esp32/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering
menu.ChipVariant=Chip Variant

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
menu.DisplayModel=Display Model

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

##############################################################

# Generic definition to be used for USB discovery of CDC/JTAG
esp32_family.name=ESP32 Family Device
esp32_family.hide=true
esp32_family.vid.0=0x303a
esp32_family.pid.0=0x1001
esp32_family.upload_port.0.vid=0x303a
esp32_family.upload_port.0.pid=0x1001
esp32_family.build.board=ESP32_FAMILY

##############################################################

watchy_v3.name=Watchy v3

watchy_v3.bootloader.tool=esptool_py
watchy_v3.bootloader.tool.default=esptool_py

watchy_v3.upload.tool=esptool_py
watchy_v3.upload.tool.default=esptool_py
watchy_v3.upload.tool.network=esp_ota

watchy_v3.upload.maximum_size=1310720
watchy_v3.upload.maximum_data_size=327680
watchy_v3.upload.flags=
watchy_v3.upload.extra_flags=
watchy_v3.upload.use_1200bps_touch=false
watchy_v3.upload.wait_for_upload_port=false

watchy_v3.serial.disableDTR=false
watchy_v3.serial.disableRTS=false

watchy_v3.build.tarch=xtensa
watchy_v3.build.bootloader_addr=0x0
watchy_v3.build.target=esp32s3
watchy_v3.build.mcu=esp32s3
watchy_v3.build.core=esp32
watchy_v3.build.variant=esp32s3
watchy_v3.build.board=WATCHY_V3

watchy_v3.build.usb_mode=1
watchy_v3.build.cdc_on_boot=0
watchy_v3.build.msc_on_boot=0
watchy_v3.build.dfu_on_boot=0
watchy_v3.build.f_cpu=240000000L
watchy_v3.build.flash_size=4MB
watchy_v3.build.flash_freq=80m
watchy_v3.build.flash_mode=dio
watchy_v3.build.boot=qio
watchy_v3.build.boot_freq=80m
watchy_v3.build.partitions=default
watchy_v3.build.defines=
watchy_v3.build.loop_core=
watchy_v3.build.event_core=
watchy_v3.build.psram_type=qspi
watchy_v3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
watchy_v3.menu.JTAGAdapter.default=Disabled
watchy_v3.menu.JTAGAdapter.default.build.copy_jtag_files=0
watchy_v3.menu.JTAGAdapter.builtin=Integrated USB JTAG
watchy_v3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
watchy_v3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
watchy_v3.menu.JTAGAdapter.external=FTDI Adapter
watchy_v3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
watchy_v3.menu.JTAGAdapter.external.build.copy_jtag_files=1
watchy_v3.menu.JTAGAdapter.bridge=ESP USB Bridge
watchy_v3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
watchy_v3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

watchy_v3.menu.PSRAM.disabled=Disabled
watchy_v3.menu.PSRAM.disabled.build.defines=
watchy_v3.menu.PSRAM.disabled.build.psram_type=qspi
watchy_v3.menu.PSRAM.enabled=QSPI PSRAM
watchy_v3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
watchy_v3.menu.PSRAM.enabled.build.psram_type=qspi
watchy_v3.menu.PSRAM.opi=OPI PSRAM
watchy_v3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
watchy_v3.menu.PSRAM.opi.build.psram_type=opi

watchy_v3.menu.FlashMode.qio=QIO 80MHz
watchy_v3.menu.FlashMode.qio.build.flash_mode=dio
watchy_v3.menu.FlashMode.qio.build.boot=qio
watchy_v3.menu.FlashMode.qio.build.boot_freq=80m
watchy_v3.menu.FlashMode.qio.build.flash_freq=80m
watchy_v3.menu.FlashMode.qio120=QIO 120MHz
watchy_v3.menu.FlashMode.qio120.build.flash_mode=dio
watchy_v3.menu.FlashMode.qio120.build.boot=qio
watchy_v3.menu.FlashMode.qio120.build.boot_freq=120m
watchy_v3.menu.FlashMode.qio120.build.flash_freq=80m
watchy_v3.menu.FlashMode.dio=DIO 80MHz
watchy_v3.menu.FlashMode.dio.build.flash_mode=dio
watchy_v3.menu.FlashMode.dio.build.boot=dio
watchy_v3.menu.FlashMode.dio.build.boot_freq=80m
watchy_v3.menu.FlashMode.dio.build.flash_freq=80m
watchy_v3.menu.FlashMode.opi=OPI 80MHz
watchy_v3.menu.FlashMode.opi.build.flash_mode=dout
watchy_v3.menu.FlashMode.opi.build.boot=opi
watchy_v3.menu.FlashMode.opi.build.boot_freq=80m
watchy_v3.menu.FlashMode.opi.build.flash_freq=80m

watchy_v3.menu.FlashSize.4M=4MB (32Mb)
watchy_v3.menu.FlashSize.4M.build.flash_size=4MB
watchy_v3.menu.FlashSize.8M=8MB (64Mb)
watchy_v3.menu.FlashSize.8M.build.flash_size=8MB
watchy_v3.menu.FlashSize.16M=16MB (128Mb)
watchy_v3.menu.FlashSize.16M.build.flash_size=16MB
watchy_v3.menu.FlashSize.32M=32MB (256Mb)
watchy_v3.menu.FlashSize.32M.build.flash_size=32MB

watchy_v3.menu.LoopCore.1=Core 1
watchy_v3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
watchy_v3.menu.LoopCore.0=Core 0
watchy_v3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

watchy_v3.menu.EventsCore.1=Core 1
watchy_v3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
watchy_v3.menu.EventsCore.0=Core 0
watchy_v3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

watchy_v3.menu.USBMode.hwcdc=Hardware CDC and JTAG
watchy_v3.menu.USBMode.hwcdc.build.usb_mode=1
watchy_v3.menu.USBMode.default=USB-OTG (TinyUSB)
watchy_v3.menu.USBMode.default.build.usb_mode=0

watchy_v3.menu.CDCOnBoot.default=Disabled
watchy_v3.menu.CDCOnBoot.default.build.cdc_on_boot=0
watchy_v3.menu.CDCOnBoot.cdc=Enabled
watchy_v3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

watchy_v3.menu.MSCOnBoot.default=Disabled
watchy_v3.menu.MSCOnBoot.default.build.msc_on_boot=0
watchy_v3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
watchy_v3.menu.MSCOnBoot.msc.build.msc_on_boot=1

watchy_v3.menu.DFUOnBoot.default=Disabled
watchy_v3.menu.DFUOnBoot.default.build.dfu_on_boot=0
watchy_v3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
watchy_v3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

watchy_v3.menu.UploadMode.default=UART0 / Hardware CDC
watchy_v3.menu.UploadMode.default.upload.use_1200bps_touch=false
watchy_v3.menu.UploadMode.default.upload.wait_for_upload_port=false
watchy_v3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
watchy_v3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
watchy_v3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

watchy_v3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
watchy_v3.menu.PartitionScheme.default.build.partitions=default
watchy_v3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
watchy_v3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
watchy_v3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
watchy_v3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
watchy_v3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
watchy_v3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
watchy_v3.menu.PartitionScheme.minimal.build.partitions=minimal
watchy_v3.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
watchy_v3.menu.PartitionScheme.no_fs.build.partitions=no_fs
watchy_v3.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
watchy_v3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
watchy_v3.menu.PartitionScheme.no_ota.build.partitions=no_ota
watchy_v3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
watchy_v3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
watchy_v3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
watchy_v3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
watchy_v3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
watchy_v3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
watchy_v3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
watchy_v3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
watchy_v3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
watchy_v3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
watchy_v3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
watchy_v3.menu.PartitionScheme.huge_app.build.partitions=huge_app
watchy_v3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
watchy_v3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/128KB SPIFFS)
watchy_v3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
watchy_v3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
watchy_v3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
watchy_v3.menu.PartitionScheme.fatflash.build.partitions=ffat
watchy_v3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
watchy_v3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
watchy_v3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
watchy_v3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
watchy_v3.menu.PartitionScheme.rainmaker=RainMaker 4MB
watchy_v3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
watchy_v3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
watchy_v3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
watchy_v3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
watchy_v3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
watchy_v3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
watchy_v3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
watchy_v3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
watchy_v3.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
watchy_v3.menu.PartitionScheme.app5M_fat24M_32MB.build.partitions=large_fat_32MB
watchy_v3.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
watchy_v3.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
watchy_v3.menu.PartitionScheme.app5M_little24M_32MB.build.partitions=large_littlefs_32MB
watchy_v3.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
watchy_v3.menu.PartitionScheme.app13M_data7M_32MB=32M Flash (13MB APP/6.75MB SPIFFS)
watchy_v3.menu.PartitionScheme.app13M_data7M_32MB.build.partitions=default_32MB
watchy_v3.menu.PartitionScheme.app13M_data7M_32MB.upload.maximum_size=13107200
watchy_v3.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
watchy_v3.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
watchy_v3.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
watchy_v3.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
watchy_v3.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
watchy_v3.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
watchy_v3.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
watchy_v3.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
watchy_v3.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
watchy_v3.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
watchy_v3.menu.PartitionScheme.custom=Custom
watchy_v3.menu.PartitionScheme.custom.build.partitions=
watchy_v3.menu.PartitionScheme.custom.upload.maximum_size=16777216

watchy_v3.menu.CPUFreq.240=240MHz (WiFi)
watchy_v3.menu.CPUFreq.240.build.f_cpu=240000000L
watchy_v3.menu.CPUFreq.160=160MHz (WiFi)
watchy_v3.menu.CPUFreq.160.build.f_cpu=160000000L
watchy_v3.menu.CPUFreq.80=80MHz (WiFi)
watchy_v3.menu.CPUFreq.80.build.f_cpu=80000000L
watchy_v3.menu.CPUFreq.40=40MHz
watchy_v3.menu.CPUFreq.40.build.f_cpu=40000000L
watchy_v3.menu.CPUFreq.20=20MHz
watchy_v3.menu.CPUFreq.20.build.f_cpu=20000000L
watchy_v3.menu.CPUFreq.10=10MHz
watchy_v3.menu.CPUFreq.10.build.f_cpu=10000000L

watchy_v3.menu.UploadSpeed.921600=921600
watchy_v3.menu.UploadSpeed.921600.upload.speed=921600
watchy_v3.menu.UploadSpeed.115200=115200
watchy_v3.menu.UploadSpeed.115200.upload.speed=115200
watchy_v3.menu.UploadSpeed.256000.windows=256000
watchy_v3.menu.UploadSpeed.256000.upload.speed=256000
watchy_v3.menu.UploadSpeed.230400.windows.upload.speed=256000
watchy_v3.menu.UploadSpeed.230400=230400
watchy_v3.menu.UploadSpeed.230400.upload.speed=230400
watchy_v3.menu.UploadSpeed.460800.linux=460800
watchy_v3.menu.UploadSpeed.460800.macosx=460800
watchy_v3.menu.UploadSpeed.460800.upload.speed=460800
watchy_v3.menu.UploadSpeed.512000.windows=512000
watchy_v3.menu.UploadSpeed.512000.upload.speed=512000

watchy_v3.menu.DebugLevel.none=None
watchy_v3.menu.DebugLevel.none.build.code_debug=0
watchy_v3.menu.DebugLevel.error=Error
watchy_v3.menu.DebugLevel.error.build.code_debug=1
watchy_v3.menu.DebugLevel.warn=Warn
watchy_v3.menu.DebugLevel.warn.build.code_debug=2
watchy_v3.menu.DebugLevel.info=Info
watchy_v3.menu.DebugLevel.info.build.code_debug=3
watchy_v3.menu.DebugLevel.debug=Debug
watchy_v3.menu.DebugLevel.debug.build.code_debug=4
watchy_v3.menu.DebugLevel.verbose=Verbose
watchy_v3.menu.DebugLevel.verbose.build.code_debug=5

watchy_v3.menu.EraseFlash.none=Disabled
watchy_v3.menu.EraseFlash.none.upload.erase_cmd=
watchy_v3.menu.EraseFlash.all=Enabled
watchy_v3.menu.EraseFlash.all.upload.erase_cmd=-e

watchy_v3.menu.ZigbeeMode.default=Disabled
watchy_v3.menu.ZigbeeMode.default.build.zigbee_mode=
watchy_v3.menu.ZigbeeMode.default.build.zigbee_libs=
watchy_v3.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
watchy_v3.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
watchy_v3.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote
